Revit 2027 API
SpatialFieldManager.SetResultSchema Method
 Sets a new value for an existing result schema in the result registry
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetResultSchema(
	int idx,
	AnalysisResultSchema resultSchema
)
Public Sub SetResultSchema (
	idx As Integer,
	resultSchema As AnalysisResultSchema
)
public:
void SetResultSchema(
	int idx,
	AnalysisResultSchema^ resultSchema
)
member SetResultSchema :
        idx : int *
        resultSchema : AnalysisResultSchema -> unit
Parameters
idx Int32
 Index of registered result schema
resultSchema AnalysisResultSchema
 Result schema replacing the existent one
Exceptions
Exception | Condition
ArgumentException |  idx refers to non-existent result schema -or- name of resultSchema is not unique in view
ArgumentNullException |  A non-optional argument was null
See Also
Reference
SpatialFieldManager Class
Autodesk.Revit.DB.Analysis Namespace